# AddEdge Method (Reference, Double, Reference, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..AddEdge Method (Reference, Double, Reference, Double)
Form Class See Also
---
Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void AddEdge(
	Reference startEdgeReference,
	double startParam,
	Reference endEdgeReference,
	double endParam
)
```

Visual Basic
---
```text
Public Sub AddEdge ( _
	startEdgeReference As Reference, _
	startParam As Double, _
	endEdgeReference As Reference, _
	endParam As Double _
)
```

Visual C++
---
```text
public:
void AddEdge(
	Reference^ startEdgeReference,
	double startParam,
	Reference^ endEdgeReference,
	double endParam
)
```

# ### Parameters
startEdgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe geometry reference of start edge
startParam
    Type: System..::..DoubleThe param on start edge to specify the location.
endEdgeReference
    Type: Autodesk.Revit.DB..::..ReferenceThe geometry reference of end edge
endParam
    Type: System..::..DoubleThe param on end edge to specify the location.
# See Also
Form Class
AddEdge Overload
Autodesk.Revit.DB Namespace